---
kind: enumMember
id: F:Autodesk.Revit.DB.IFC.IFCDataPrimitiveType.Binary
enum: Autodesk.Revit.DB.IFC.IFCDataPrimitiveType
source: html/251abe68-f18c-a4f3-f86d-15a5fa0f9f3a.htm
---
# Autodesk.Revit.DB.IFC.IFCDataPrimitiveType.Binary

Binary.
 When reading or writing an IFCData of primitive type Binary,
 the value will be the string representation of the binary value
 as seen in the IFC specification.